// 自動生成されたコードです。変更しないでください。
namespace myTiles {
    //% fixedInstance jres blockIdentity=images._tile
    export const transparency16 = image.ofBuffer(hex``);

    helpers._registerFactory("tilemap", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "レベル1":
            case "レベル1":return tiles.createTilemap(hex`1000100001010101010101010101010101010101010102020202020101010101010101010101010101010101010101020101010102020202020202020201010201010101010101010101010101010101010102010101010101010101010202020201020101010102010101010101010101010102010101020101010101010101010201020101010201010202010102020102010201010102010101010101010101020102010101020101010201010101010101010102020101010102010202010101010101010101010201020101010202020101010102010102010201010101010101010101020101020101010102020201010101010101010101010101010101010101`, img`
. . . . . . . . . . . . . . . . 
. . 2 2 2 2 2 . . . . . . . . . 
. . . . . . . . . . . 2 . . . . 
2 2 2 2 2 2 2 2 2 . . 2 . . . . 
. . . . . . . . . . . . . . 2 . 
. . . . . . . . . 2 2 2 2 . 2 . 
. . . 2 . . . . . . . . . . . 2 
. . . 2 . . . . . . . . . 2 . 2 
. . . 2 . . 2 2 . . 2 2 . 2 . 2 
. . . 2 . . . . . . . . . 2 . 2 
. . . 2 . . . 2 . . . . . . . . 
. 2 2 . . . . 2 . 2 2 . . . . . 
. . . . . 2 . 2 . . . 2 2 2 . . 
. . 2 . . 2 . 2 . . . . . . . . 
. . 2 . . 2 . . . . 2 2 2 . . . 
. . . . . . . . . . . . . . . . 
`, [myTiles.transparency16,sprites.castle.tilePath5,sprites.builtin.brick], TileScale.Sixteen);
            case "レベル2":
            case "レベル2":return tiles.createTilemap(hex`0a0008000001000000000000000000010000000101010000000100000000000000000001000101010101000000000000000000000000000000000100000000000001010001000000000000000000010000010000`, img`
. 2 . . . . . . . . 
. 2 . . . 2 2 2 . . 
. 2 . . . . . . . . 
. 2 . 2 2 2 2 2 . . 
. . . . . . . . . . 
. . . . 2 . . . . . 
. 2 2 . 2 . . . . . 
. . . . 2 . . 2 . . 
`, [myTiles.transparency16,sprites.builtin.brick], TileScale.Sixteen);
        }
        return null;
    })

    helpers._registerFactory("tile", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "transparency16":return transparency16;
        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
